const source = require("./source");

const src = 
{
    date01: "2018-06-01T18:17:12.745+07:00",
    date02: "2018-06-01T18:17:12.745Z",
    date03: "2018-06-01T18:17:12",
    date04: "2018-06-01T18:17:12.745",
    date05: "2018-06-01+07:00",
    date06: "2018-06-01",
    date07: "www.ru; 12-03-2018 года 11:00 часов",
    date08: "2018-05-17 года в 15:00 (по местному времени).",
    date09: "www.ru; 12.03.2018 года 11:00 часов",
    date10: "2018.05.17 года в 15:00 (по местному времени).",
    date11: "www.ru; 12-03-2018 года",
    date12: "2018-05-17 года",
    date13: "www.ru; 12.03.2018 года",
    date14: "2018.05.17 года",
    date15: "1 января 2017 года",
    date16: "11 августа 2018 года",
    date17: "02 дек. 2018 года",
    date18: '"02" ноя. 2018 года',
    date19: "«02» сен. 2018 года",
    date20: "27/03/2018 г. в 10:00 (по московскому времени)"
}

const res = {
    date01: "2018-06-01T18:17:12.745+07:00",
    date02: "2018-06-01T18:17:12.745Z",
    date03: "2018-06-01T18:17:12.000Z",
    date04: "2018-06-01T18:17:12.745Z",
    date05: "2018-06-01T00:00:00.000+07:00",
    date06: "2018-06-01T00:00:00.000Z",
    date07: "2018-03-12T11:00:00.000Z",
    date08: "2018-05-17T15:00:00.000Z",
    date09: "2018-03-12T11:00:00.000Z",
    date10: "2018-05-17T15:00:00.000Z",
    date11: "2018-03-12T00:00:00.000Z",
    date12: "2018-05-17T00:00:00.000Z",
    date13: "2018-03-12T00:00:00.000Z",
    date14: "2018-05-17T00:00:00.000Z",
    date15: "2017-01-01T00:00:00.000Z",
    date16: "2018-08-11T00:00:00.000Z",
    date17: "2018-12-02T00:00:00.000Z",
    date18: "2018-11-02T00:00:00.000Z",
    date19: "2018-09-02T00:00:00.000Z",
    date20: "2018-03-27T10:00:00.000Z" 
}


Object.keys( src ).forEach( key => {
    const result = source({ src,  options: key });
    console.log( "KEY=" + key );
    console.log( src[key] );
    console.log( result );
    console.log( result === res[key])
    console.log("\n");
});


