const source = require("./source");

const collectionTestDateStrings = [
    "2018-06-01T18:17:12.745+07:00",
    "2018-06-01T18:17:12.745Z",
    "2018-06-01T18:17:12",
    "2018-06-01T18:17:12.745",
    "2018-06-01+07:00",
    "2018-06-01",
    "www.ru; 12-03-2018 года 11:00 часов",
    "2018-05-17 года в 15:00 (по местному времени).",
    "www.ru; 12.03.2018 года 11:00 часов",
    "2018.05.17 года в 15:00 (по местному времени).",
    "www.ru; 12-03-2018 года",
    "2018-05-17 года",
    "www.ru; 12.03.2018 года",
    "2018.05.17 года",
    "1 января 2017 года",
    "11 августа 2018 года",
    "02 дек. 2018 года",
    '"02" ноя. 2018 года',
    "«02» сен. 2018 года",
    "27/03/2018 г. в 10:00 (по московскому времени)"
];

collectionTestDateStrings.map( testDateString => source.toISO(testDateString) );


